app/controllers/comments_controller.rb

  def index
    @comments = Comment.paginate(:order => "created_at DESC", :page => params[:page], :per_page => 10)
---
SELECT * FROM "comments" ORDER BY created_at DESC LIMIT 20 OFFSET 0

  def create
    @comment = Comment.new(params[:comment])
    @comment.author = current_user
    @comment.post = Post.find params[:post_id]
    respond_to do |format|
      if @comment.save
---
SELECT * FROM "posts" WHERE ("posts"."id" = 6)
INSERT INTO "comments" ("created_at", "updated_at", "post_id", "user_id", "content") VALUES('2009-05-01 19:24:16', '2009-05-01 19:24:16', 1, 1, 'Мой комент')
UPDATE "posts" SET "comments_count" = COALESCE("comments_count", 0) + 1 WHERE ("id" = 6)

  def update
    return redirect_to root_path if !user_can_edit? @comment
    respond_to do |format|
      if @comment.update_attributes(params[:comment])
---
UPDATE "comments" SET "updated_at" = '2009-05-01 22:11:36', "content" = '12345 вышел зайчик погулять.' WHERE "id" = 8

  def destroy
    return redirect_to root_path if !user_can_edit? @comment
    respond_to do |format|
      if @comment.destroy
---
DELETE FROM "comments" WHERE "id" = 2

  def find_object
    @comment = Comment.find(params[:id]) if params[:id]
---
SELECT * FROM "comments" WHERE ("comments"."id" = 8)