app/controllers/posts_controller.rb

SELECT * FROM "posts" WHERE ("posts"."published" = 't') ORDER BY created_at DESC LIMIT 3 OFFSET 0
SELECT count(*) AS count_all FROM "posts" WHERE ("posts"."published" = 't')
---
  def index
    @posts = Post.published.paginate :page => params[:page], :per_page => 10

INSERT INTO "posts" ("created_at", "published", "updated_at", "content") VALUES('2009-04-28 15:59:45', 't', '2009-04-28 15:59:45', 'Это *очень* короткая заметка без ссылки.')
---
  def create
    @post = Post.new(params[:post])
    @post.published = true
    @post.author = current_user

    if params.has_key?(:user)
      current_user.name = params[:user][:name] if !params[:user][:name].empty?
      current_user.save
    end

    respond_to do |format|
      if @post.valid? && current_user.valid?
        @post.save

UPDATE "posts" SET "updated_at" = '2009-05-01 12:56:08', "content" = '1234' WHERE "id" = 8
---
  def update
    return redirect_to root_path if !user_can_edit? @post
    respond_to do |format|
      if @post.update_attributes(params[:post])

DELETE FROM "posts" WHERE "id" = 9
---
  def destroy
    return redirect_to root_path if !user_can_edit? @post
    @post.destroy

SELECT * FROM "posts" WHERE ("posts"."id" = 9)
---
  def find_object
    @post = Post.find(params[:id]) if params[:id]