app/controllers/session_controller.rb

  def create
    current_url = url_for(:action => 'create', :only_path => false)
    return_to = params[:return_to]
    parameters = params.reject{ |k, v| request.path_parameters[k] }
    oidresp = consumer.complete(parameters, current_url)

    if oidresp.status == OpenID::Consumer::SUCCESS
      open_id = oidresp.display_identifier
      user = User.find_or_create_by_open_id(open_id)
      ax_resp = OpenID::AX::FetchResponse.from_success_response(oidresp)
      if ax_resp
        email = ax_resp['http://axschema.org/contact/email'].first
        user = User.find_or_create_by_email(email)
        user.open_id = open_id
        user.save(false)
---
SELECT "users".id FROM "users" WHERE ("users"."email" = 'vladislav.semenov@gmail.com' AND "users".id <> 1) LIMIT 1
UPDATE "users" SET "updated_at" = '2009-05-01 09:06:10', "oauth_token" = '1/kKyOW2P1RCsLsKcmuT8tSmATiaQZnWPB51nTvo8n9Sw', "oauth_secret" = 'yDiTm6Y6/5brq4E5J096+XBc' WHERE "id" = 1